slides/04_ajax.tex
% Created 2015-05-26 Tue 06:11
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usetheme{default}
\usecolortheme{spruce}
\author{Ustun Ozgur}
\date{2015-05-26 Tue}
\title{AJAX with React}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\begin{frame}[label=sec-1]{Ajax with React}
\begin{itemize}
\item React is agnostic wrt to Ajax
\item It is just a view layer
\item Just do the AJAX request, for example using jQuery's get function
\item Register the response data in components state.
\begin{itemize}
\item In the success handler, call setState.
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2]{componentDidMount}
\begin{itemize}
\item This is a special lifecycle method like render.
\item Called when the component is mounted to the real DOM.
\item The technique: Initialize the state when component first mounts, then
initiate an AJAX call when it is mounted.
\item After the AJAX call, if the component is still mounted, update the state.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-3]{Example: Github}
 \begin{itemize}
\item Our aim is to retrieve and show the list of repos of a user.
\item Github has an endpoint at \texttt{https://api.github.com/users/USER\_NAME/repos} where
USER$_{\text{NAME}}$ is a placeholder.
\item This returns a json response, an array of repos.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-4]{Empty Repos Array from getInitialState}
 \begin{verbatim}
var Repos = React.createClass({
  getInitialState: function () {
    return {repos: []};
  },
  render: function () {
    var renderRepo = function (repo) {
      return <div>Repo {repo.name} {repo.date}</div>
    }
    return <div>
      {this.state.repos.map(renderRepo)}
    </div>

  }

});
\end{verbatim}
\end{frame}

\begin{frame}[fragile,label=sec-5]{Retrieving data from Github}
 \begin{verbatim}
var GITHUB_ENDPOINT = "https://api.github.com/users/ustun/repos"
var Repos = React.createClass({
  getInitialState: function () { return {repos: []};},

  componentDidMount: function () {
    $.getJSON(GITHUB_ENDPOINT, function (data) {
      this.setState({repos: data});
    }.bind(this));  },
  render: function () {
    var renderRepo = function (repo) {
      return <div>Repo {repo.name} {repo.created_at}</div>}
    return <div>{this.state.repos.map(renderRepo)}</div>
  }
});
\end{verbatim}
\end{frame}

\begin{frame}[fragile,label=sec-6]{Making sure that the component is still mounted}
 \begin{itemize}
\item When we initiate the request, the component is mounted,
\item When the AJAX call returns, we are not sure.
\item React might be trying to set state on a component that is no longer
mounted.
\item To guard against that, we use isMounted before setting state.
\end{itemize}

\begin{verbatim}
componentDidMount: function () {
  $.getJSON(GITHUB_ENDPOINT, function (data) {
    if (this.isMounted()) {
      this.setState({repos: data});
    }
  }.bind(this));  },
\end{verbatim}
\end{frame}

\begin{frame}[label=sec-7]{Summary}
\begin{itemize}
\item Simply call setState in response to AJAX responses.
\item A usual place to initiate AJAX calls is in componentDidMount.
\item AJAX calls can be initiated in event handlers too, it does not matter.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-8]{Exercise}
 \begin{itemize}
\item Instagram has an API at \url{https://api.instagram.com/v1/tags/nofilter/media/recent?client_id=CLIENT_ID} where nofilter is the name of the tag.
\item For the workshop, you can use CLIENT$_{\text{ID}}$=8ed8f14f61b24c95ad54583110ace715 or you can register your own Instagram app at \url{https://instagram.com/developer/}
\item Implement an Instagram client that shows the photos tagged as HDR.
\item The API returns a limited subset of responses, but has a next parameter. Add a "Load More" button at the bottom that loads more items from the API.
\item Instagram implements same origin policy. To disable, - \verb~open -a Google\ Chrome --args --disable-web-security~
\item \texttt{chrome.exe -{}-disable-web-security}
\end{itemize}
\end{frame}
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}
